app/controllers/reset_controller.rb

DELETE FROM "transactions"
DELETE FROM "wallets"
---
  def destroy
    # Wrap deletion in a transaction to ensure consistency
    ActiveRecord::Base.transaction do
      Transaction.delete_all  # Delete all transactions
      Wallet.delete_all       # Delete all wallets