app/controllers/transactions_controller.rb

  def create
    # Create a new transaction (money transfer)
    transaction = Transaction.new(transaction_params)

    if transaction.save
---
INSERT INTO "transactions" ("amount", "source_wallet_id", "target_wallet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["amount", 100.0], ["source_wallet_id", 1], ["target_wallet_id", 2], ["created_at", "2024-10-21 08:03:15.082422"], ["updated_at", "2024-10-21 08:03:15.082422"]]

  def index
    # Retrieve all transactions (optional: add filters for wallets)
    transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"