app/controllers/wallets_controller.rb

SELECT "wallets".* FROM "wallets"
INSERT INTO "wallets" ("balance", "owner_type", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["balance", 1000.0], ["owner_type", "User"], ["owner_id", 1], ["created_at", "2024-10-21 07:46:39.495653"], ["updated_at", "2024-10-21 07:46:39.495653"]]
---
  def index
    wallets = Wallet.all

    render json: JSON.pretty_generate(
      wallets.map do |wallet|
        {
          id: wallet.id,
          owner_type: wallet.owner_type,
          owner_id: wallet.owner_id,
          balance: wallet.balance,  # Use updated balance from database
          created_at: wallet.created_at,
          updated_at: wallet.updated_at
        }
      end
    ), status: :ok

INSERT INTO "wallets" ("balance", "owner_type", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["balance", 1000.0], ["owner_type", "User"], ["owner_id", 1], ["created_at", "2024-10-21 07:46:39.495653"], ["updated_at", "2024-10-21 07:46:39.495653"]]
INSERT INTO "wallets" ("balance", "owner_type", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["balance", 1000.0], ["owner_type", "User"], ["owner_id", 10], ["created_at", "2024-10-24 12:54:26.618018"], ["updated_at", "2024-10-24 12:54:26.618018"]]
---
  def create
    # Create a wallet for a specific entity (User, Team, etc.)
    # wallet = Wallet.new(wallet_params)
	# Dynamically find or create the owner based on owner_type and user name
	owner_class = params[:wallet][:owner_type].constantize
    owner = owner_class.find_or_create_by(name: wallet_params[:user][:name])

    # Create a new wallet with the specified owner and balance
    wallet = Wallet.new(balance: wallet_params[:balance], owner: owner)

    if wallet.save

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # Retrieve wallet details by ID
    wallet = Wallet.find(params[:id])

SELECT "wallets".* FROM "wallets" WHERE "wallets"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def balance
    # Retrieve the current balance of a specific wallet
    wallet = Wallet.find(params[:id])