app/models/transaction.rb

  def update_wallet_balances
    Wallet.transaction do
      source_wallet.update!(balance: source_wallet.balance - amount) if source_wallet
      target_wallet.update!(balance: target_wallet.balance + amount) if target_wallet
---
UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 2000.0], ["updated_at", "2024-10-24 13:24:08.492619"], ["id", 18]]
UPDATE "wallets" SET "balance" = ?, "updated_at" = ? WHERE "wallets"."id" = ?  [["balance", 0.0], ["updated_at", "2024-10-24 13:11:19.722777"], ["id", 16]]